K9DTV/minime-ii-esp32-discord-bot/MiniMe_Discord_Bot_II/discord_rest.cpp
#include "minime.h"
#include "cores.h"
#include "esp_crt_bundle.h"
#include <new>

WiFiClientSecure httpsClient;
bool httpsInUse = false;

// Gateway HB always; drain cmds only when shared HTTPS is free (DeepSeek has its own TLS).
static void pumpNetWait() {
  pumpGateway();
  if (!httpsInUse) drainDiscordCmds();
}

void boardMemTotals(uint32_t& memFree, uint32_t& memTotal) {
  // Internal SRAM only — LCD/web heap bar must not hide internal exhaustion behind free PSRAM.
  memTotal = ESP.getHeapSize();
  memFree = ESP.getFreeHeap();
}

void boardPsramTotals(uint32_t& psFree, uint32_t& psTotal) {
  psTotal = ESP.getPsramSize();
  psFree = ESP.getFreePsram();
}

void uptimeDhms(unsigned long& days, unsigned long& hours, unsigned long& minutes, unsigned long& seconds) {
  unsigned long sec = millis() / 1000;
  days = sec / 86400;
  hours = (sec % 86400) / 3600;
  minutes = (sec % 3600) / 60;
  seconds = sec % 60;
  if (days > 9999) days = 9999;
}

String getSystemInfo() {
  long rssi = WiFi.RSSI();
  uint32_t freeHeap = 0, totalHeap = 0, freePs = 0, totalPs = 0;
  boardMemTotals(freeHeap, totalHeap);
  boardPsramTotals(freePs, totalPs);
  unsigned long days = 0, hours = 0, minutes = 0, seconds = 0;
  uptimeDhms(days, hours, minutes, seconds);
  String uptimeStr = String(days) + "d " + String(hours) + "h " + String(minutes) + "m " + String(seconds) + "s";
  String msg = "📊 **System Diagnostics:**\n"
         "• **Uptime:** " + uptimeStr + "\n"
         "• **Internal heap:** " + String((unsigned long)freeHeap) + " / " +
         String((unsigned long)totalHeap) + " bytes\n";
  if (totalPs > 0) {
    msg += "• **PSRAM:** " + String((unsigned long)freePs) + " / " +
           String((unsigned long)totalPs) + " bytes\n";
  } else {
    msg += "• **PSRAM:** none\n";
  }
  msg += "• **WiFi RSSI:** " + String(rssi) + " dBm\n"
         "• **Gateway Status:** " + String((gatewayConnected && identified) ? "Connected" : "Disconnected") + "\n"
         "• **MmLog Core0 drops:** " + String((unsigned long)mmLogDropCore0.load()) + " (ring overflow)\n";
  {
    uint8_t n = cmdErrorReplyCount();
    msg += "• **Cmd errors (" + String((unsigned)n) + "/" + String((unsigned)CMD_ERR_RING_N) + "):**\n";
    if (n == 0) {
      msg += "  (none)\n";
    } else {
      // Newest first; cap so !sys still fits Discord 2000.
      uint8_t show = n;
      if (show > 5) show = 5;
      for (uint8_t i = 0; i < show; i++) {
        char row[97];
        if (!cmdErrorReplyNewest(i, row, sizeof(row))) break;
        msg += "  - " + truncateText(String(row), 120) + "\n";
      }
      if (n > show) msg += "  - … +" + String((unsigned)(n - show)) + " more (Serial / Log panel)\n";
    }
  }
  msg += "• **Firmware:** https://github.com/K9DTV/minime-ii-esp32-discord-bot";
  return msg;
}

bool sendDiscordCmdError(const String& channelId, const String& content, bool suppressEmbeds) {
  noteCmdErrorReply(content.c_str());
  return sendDiscordMessage(channelId, content, suppressEmbeds);
}

// Cap header/status lines so a broken peer cannot grow String without bound.
static const size_t HTTP_LINE_MAX = 512;

// Escape for Discord JSON content (Core 1 only; not reentrant with concurrent send).
static size_t jsonEscape(const char* in, char* out, size_t outSize) {
  size_t o = 0;
  for (size_t i = 0; in[i] && o + 2 < outSize; i++) {
    const char c = in[i];
    if (c == '"' || c == '\\') {
      out[o++] = '\\';
      out[o++] = c;
    } else if (c == '\n') {
      out[o++] = '\\';
      out[o++] = 'n';
    } else if (c == '\r') {
      out[o++] = '\\';
      out[o++] = 'r';
    } else if (c == '\t') {
      out[o++] = '\\';
      out[o++] = 't';
    } else if ((uint8_t)c < 0x20) {
      // skip other controls
    } else {
      out[o++] = c;
    }
  }
  out[o] = '\0';
  return o;
}

bool sendDiscordMessage(const String& channelId, const String& content, bool suppressEmbeds) {
  unsigned long startedAt = millis();

  // Truncate to Discord cap, then escape into fixed buffers (.bss — Core 1, not reentrant).
  static char raw[DISCORD_CONTENT_MAX + 1];
  static char esc[DISCORD_CONTENT_MAX * 2 + 4];
  static char body[DISCORD_CONTENT_MAX * 2 + 80];
  static char request[DISCORD_CONTENT_MAX * 2 + 400];

  size_t n = content.length();
  if (n > (size_t)DISCORD_CONTENT_MAX) {
    memcpy(raw, content.c_str(), (size_t)DISCORD_CONTENT_MAX - 3);
    raw[DISCORD_CONTENT_MAX - 3] = '.';
    raw[DISCORD_CONTENT_MAX - 2] = '.';
    raw[DISCORD_CONTENT_MAX - 1] = '.';
    raw[DISCORD_CONTENT_MAX] = '\0';
  } else {
    memcpy(raw, content.c_str(), n);
    raw[n] = '\0';
  }
  jsonEscape(raw, esc, sizeof(esc));

  int bodyLen = snprintf(body, sizeof(body),
                         "{\"content\":\"%s\",\"tts\":false%s}",
                         esc,
                         suppressEmbeds ? ",\"flags\":4" : "");
  if (bodyLen < 0 || (size_t)bodyLen >= sizeof(body)) return false;

  int reqLen = snprintf(request, sizeof(request),
                        "POST /api/v10/channels/%s/messages HTTP/1.1\r\n"
                        "Host: discord.com\r\n"
                        "Authorization: Bot %s\r\n"
                        "Content-Type: application/json\r\n"
                        "User-Agent: " MINIME_USER_AGENT "\r\n"
                        "Content-Length: %d\r\n"
                        "Connection: close\r\n\r\n"
                        "%s",
                        channelId.c_str(), BOT_TOKEN, bodyLen, body);
  if (reqLen < 0 || (size_t)reqLen >= sizeof(request)) return false;

  for (uint8_t attempt = 0; attempt < DISCORD_REST_MAX_ATTEMPTS; attempt++) {
    if ((millis() - startedAt) > 60000UL) return false;
    if (!httpsAcquire("discord.com")) return false;
    httpsClient.write((const uint8_t*)request, (size_t)reqLen);
    unsigned long deadline = millis() + 8000UL;
    String statusLine;
    bool chunked = false;
    int contentLength = -1;
    float retryAfterSec = -1.f;
    // pump=true: HB stays alive while waiting for Discord headers / during retry backoff.
    if (!httpsAwaitHeaders(httpsClient, deadline, true, statusLine, chunked, contentLength, &retryAfterSec)) {
      httpsRelease();
      if ((millis() - startedAt) > 60000UL) return false;
      MmLog.print(F("[REST] Discord header timeout attempt "));
      MmLog.print((unsigned)(attempt + 1));
      MmLog.print(F("/"));
      MmLog.println((unsigned)DISCORD_REST_MAX_ATTEMPTS);
      if (attempt + 1 >= DISCORD_REST_MAX_ATTEMPTS) return false;
      unsigned long waitUntil = millis() + DISCORD_HEADER_RETRY_WAIT_MS;
      while ((long)(millis() - waitUntil) < 0) {
        if ((millis() - startedAt) > 60000UL) return false;
        pumpNetWait();
        delay(10);
      }
      continue;
    }
    int code = 0;
    int sp = statusLine.indexOf(' ');
    if (sp >= 0) code = statusLine.substring(sp + 1).toInt();

    if (code >= 200 && code < 300) {
      // Body unused; Connection: close + release discards it.
      httpsRelease();
      return true;
    }

